{
  "title": "Implementation of Clinical Services for Adults with Obesity in Different Health Systems: A Scoping Review and Causal Loop Diagram",
  "abstract": "Abstract The medical needs of obesity have been underrecognized, though it has posed long-term and enormous challenges to global health. Correspondingly, clinical services for obesity are still uncommon and in their infancy across health systems. It is meaningful to sort out the implementation of such clinical services involving a multiplicity of factors to identify measures for service development, scaling-up and optimization. This study aims to generate a comprehensive understanding of key variables and factors in the utilization and delivery of clinical services for adult patients with obesity and their dynamic patterns and to explore viable options for improved implementation of such services in health systems. We conducted a scoping review of published articles in the database from the lens of system dynamics through causal loop diagramming. Based on the data obtained from the review, we employed the causal loop diagramming as a tool to capture the variables in the implementation of clinical obesity services and their causal relationships. Twenty-one studies were finally included in the review. Based on the evidence consolidated through the review, we developed a causal loop diagram containing 19 causal variables and 38 causal arrows in single directions centered around the service utilization and delivery in the clinical obesity service. The feedback loops revealed potential activation points to intervene to facilitate the service implementation, such as, promotion of obesity as a disease with medical needs and available clinical services, provision of obesity-specific medical education and training opportunities, and prioritization of obesity-specific procedures in clinical protocols. The possible intervention points identified through the causal loop analysis can facilitate the development, implementation, and optimization of clinical obesity services in health systems.",
  "sections": [
    {
      "heading": "Introduction",
      "text": "Obesity has been threatening the health of nearly 770 million adults.1As a complex disease, obesity is characterized as accumulating adiposity due to loss of balance between energy intake and consumption, which exposes individuals to increased risks of morbidity and mortality.2–5The financial burden of health systems worldwide was estimated to weigh more heavily in the future due to the large population of obesity and overweight.6,7Although many countries and regions have been taking action to combat this obesity crisis through extensive policies and preventative measures, the growth momentum of obesity has not been slowed down drastically to actualize a zero-increase rate.8–15\n\nRecent pathophysiologic and clinical research highlights the significance and urgency of prioritization of the medical needs of obesity equivalent to other non-communicable diseases (NCDs), such as diabetes, cardiovascular diseases, hypertension, etc. In other words, obesity intrinsically requires medical interventions and services as a disease.5,16Clinical management of obesity follows a common step-wise intervention pathway with lifestyle interventions as the first-line therapeutic option. A few medications for long-term use and invasive procedures with desirable effectiveness and safety are also available for patients fulfilling the severity criteria of obesity and related complications.17\n\nHowever, the medical need of obesity is less commonly recognized either among the public or healthcare professionals.18–20The stigmatization of obesity is a longstanding issue taking time and whole-society efforts to shift, which largely hinders patients with obesity from seeking professional support and services.21,22Studies have reported either country-wide or geographically imbalanced inadequacy of specific professional manpower for obesity management.23,24Moreover, although novel anti-obesity drugs with desirable effectiveness in long-term weight management are emerging, their current cost-effectiveness performance may have largely constrained their accessibility to a wider patient population.25–27Unsurprisingly, the latest global environmental scan of the availability of clinical obesity services confirms the worldwide shortage of such services to formally diagnose, assess and treat this disease condition for patients in need.24Therefore, the World Health Organization (WHO) calls for health systems to improve their readiness to provide a continuum of medical care across the primary, secondary and tertiary care levels and universal health coverage for obesity in its recent initiative on health services response to obesity.28\n\nIn relevant studies, significant attention has been paid to specific elements, steps, or supporting resources in the delivery and utilization of clinical obesity services for adults with obesity. However, there is an obvious lack of original research on such services as a whole to investigate their implementation and outcomes.\n\nA causal loop diagram (CLD) is an effective visual representation tool to demonstrate not only the diverse components involved in a complex system but also the causal links and feedback mechanisms between variables.29,30It is a key step in the system dynamics to construct a conceptual model for the subsequent systems modelling and simulation processes. CLDs, either utilized independently or as part of the system dynamics modelling (SDM) approach, are instrumental in capturing the intricacy of complex issues and pinpointing potential activation points to make systematic changes.31A CLD commonly comprise variables, unidirectional arrows with either positive or negative polarity, and closed feedback loops.32\n\nHealth issues and the healthcare system are intrinsically ever-changing and convoluted, the changes of which are in accordance with the advantages of the methodology of system dynamics.33–37A cursory search of relevant literature on applying the system dynamics approach could generate various studies on a broad range of topics, covering health system and equity issues,38–41public health matters,33,42,43health service delivery,44–48management of infectious diseases and NCDs,49–53among others. Obesity is a disease known for its diverse etiologies and mechanisms. The SDM approach has also become a common method of investigating the interrelations of diverse factors leading to obesity, proposing policy and public health interventions to mitigate specific risks, and projecting the potential effectiveness and outcomes of interventions.54–60\n\nTherefore, this study seeks to generate a comprehensive understanding of key variables and factors of the delivery and utilization of clinical services for adult patients with obesity and their dynamic patterns through synthesizing evidence from relevant literature and developing a CLD. The CLD was utilized as a vehicle to construct and demonstrate the comprehensive analysis of the variables and their interlinkages in relation to the implementation of clinical obesity services from a systems perspective. This research will serve as a starting point for further investigation of optimal care models of obesity management for adults with obesity."
    },
    {
      "heading": "Methods",
      "text": "A scoping review of available literature was carried out to define the key variables of the delivery and utilization of clinical obesity services and their interrelations to guide the follow-up construction of the CLD. We followed the key steps of undertaking a scoping study proposed by Arksey and O’Malley.61The reporting of results complies with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) Extension for Scoping Reviews (PRISMA-ScR). The findings from the scoping review were then analyzed and visualized through causal loop diagramming to inform the identification of possible implications regarding the implementation of clinical service for adult patients with obesity.\n\nAfter deliberating among the main researchers involved in this study, we determined to utilize the following two questions to lead our investigation into the included studies: (1) what are the main variables in the delivery and utilization of clinical obesity services for adult patients; (2) what are the key factors that influence the delivery and utilization; and (3) what is the interplay among these variables?\n\nFor the purpose of this research, we searched the electronic database PubMed to identify the research articles in any of the following two categories: (1) studies reporting a clinical obesity service for the general adult population; and (2) studies examining any factors that influence service delivery and utilization from any perspective. The combination of two keywords “obesity” and “clinical service” was used in the initial search of relevant peer-reviewed articles published in the recent decade till 31 December 2023. We restricted our search to studies written in English or Chinese with full texts available. The detailed search strategy is presented in the Additional File 1. The references obtained from the initial search were managed by EndNote for the follow-up screening and selection processes.\n\nWe explicitly excluded studies that fall into any of the criteria listed below: (1) studies reporting clinical services for a specific group of population, such as children/adolescents, women in pregnancy, and veterans; (2) studies focusing on specific treatment strategies without providing adequate information about the other major components of a clinical service; (3) studies which were not research articles, eg, reviews, conference proceedings, commentary, editorials, and reports; and (4) substandard study quality. In addition, we also conducted hand searches of the reference lists of the key articles identified from our preliminary review of the topic.\n\nIn the first round of screening, the duplicate records were deleted. Titles and abstracts of the rest of the studies were then scanned to evaluate their relevance and eligibility, with irrelevance removed. The full texts of the remaining studies from this round were closely examined. Two independent reviewers (YX and XC) were involved in the screening and identification process for joint decisions on the final inclusion.\n\nA data extraction form was created to capture the general characteristics, including the country and setting where the study was conducted, the study design and primary data investigated, and the main findings relevant to this research. The causal variables were identified and extracted iteratively. In this process, two steps were taken to ensure the standardization of the labelling of each variable across different studies. We first characterized emerging themes surrounding variables that were identified initially. Subsequently, we adopted the themes to facilitate further identification and final inclusion of variables. We undertook an iterative approach in constructing the causal links between variables based on our close examination of the included studies. The final product of the diagramming reflected the consensus among the research team members on the understanding of the included variables and their inter-relations. The CLD was created with the software Vensim PLE 9.1.1."
    },
    {
      "heading": "Structuring Research Questions",
      "text": "After deliberating among the main researchers involved in this study, we determined to utilize the following two questions to lead our investigation into the included studies: (1) what are the main variables in the delivery and utilization of clinical obesity services for adult patients; (2) what are the key factors that influence the delivery and utilization; and (3) what is the interplay among these variables?"
    },
    {
      "heading": "Identifying and Selecting Relevant Studies",
      "text": "For the purpose of this research, we searched the electronic database PubMed to identify the research articles in any of the following two categories: (1) studies reporting a clinical obesity service for the general adult population; and (2) studies examining any factors that influence service delivery and utilization from any perspective. The combination of two keywords “obesity” and “clinical service” was used in the initial search of relevant peer-reviewed articles published in the recent decade till 31 December 2023. We restricted our search to studies written in English or Chinese with full texts available. The detailed search strategy is presented in the Additional File 1. The references obtained from the initial search were managed by EndNote for the follow-up screening and selection processes.\n\nWe explicitly excluded studies that fall into any of the criteria listed below: (1) studies reporting clinical services for a specific group of population, such as children/adolescents, women in pregnancy, and veterans; (2) studies focusing on specific treatment strategies without providing adequate information about the other major components of a clinical service; (3) studies which were not research articles, eg, reviews, conference proceedings, commentary, editorials, and reports; and (4) substandard study quality. In addition, we also conducted hand searches of the reference lists of the key articles identified from our preliminary review of the topic.\n\nIn the first round of screening, the duplicate records were deleted. Titles and abstracts of the rest of the studies were then scanned to evaluate their relevance and eligibility, with irrelevance removed. The full texts of the remaining studies from this round were closely examined. Two independent reviewers (YX and XC) were involved in the screening and identification process for joint decisions on the final inclusion."
    },
    {
      "heading": "Examining the Data and Summarizing and Visualizing Through Causal Loop Diagramming",
      "text": "A data extraction form was created to capture the general characteristics, including the country and setting where the study was conducted, the study design and primary data investigated, and the main findings relevant to this research. The causal variables were identified and extracted iteratively. In this process, two steps were taken to ensure the standardization of the labelling of each variable across different studies. We first characterized emerging themes surrounding variables that were identified initially. Subsequently, we adopted the themes to facilitate further identification and final inclusion of variables. We undertook an iterative approach in constructing the causal links between variables based on our close examination of the included studies. The final product of the diagramming reflected the consensus among the research team members on the understanding of the included variables and their inter-relations. The CLD was created with the software Vensim PLE 9.1.1."
    },
    {
      "heading": "Results",
      "text": "The data identification and selection process are displayed inFigure 1. There were 6710 articles identified through our initial search from databases. In parallel, we conducted a step of hand search of the key references in our preliminary research, which generated 209 articles on relevant topics. After de-duplicating 63 items, we screened the remaining 6856 studies by their titles and abstracts. We then examined the 219 eligible full-text articles for final inclusion. By assessing the relevance and quality of the evidence, we identified 21 studies for the follow-up review procedure.Figure 1Flow diagram of study selection.\n\nFlow diagram of study selection.\n\nTable 1contains the basic characteristics of the included studies. They were performed in five countries: Australia,62–65Canada,66,67New Zealand,68,69the UK,70–72and the US.73–82The settings of the clinical obesity services examined in these studies were diverse. Thirteen studies were in the primary care setting,62,66–70,72–75,78,80,82three studies were in a secondary/tertiary care setting (3,5,11), and the rest were in a general medical setting.64,76,77,79,81The research designs include three major categories: qualitative approach,62–64,68,69,72,80quantitative approach,65–67,70,73–79,81and mixed-methods approach.71,82Among the seven qualitative studies, interviews were the primary channel to collect primary data from different groups of stakeholders, eg, healthcare providers, clinical administrations, service teams, patients, and the public. The data from the 12 quantitative studies were mainly obtained from electronic medical records and surveys.Table 1Characteristics of the Included StudiesNoRef.CountrySettingStudy DesignData InvestigatedPrimary Research Questions162(2019)AustraliaPrimary careQualitative interviewsInterview input from clinical practitionersTo investigate the factors that impact the clinical practitioners’ execution of a clinical practice guideline for the management of obesity and overweight in Australia263(2021)AustraliaTertiary careQualitative interviewsInterview input from clinical leaders and managers working in services that care for patients with obesityTo understand how the clinical leadership perceives the inpatient service provided for people with morbid obesity364(2020)AustraliaGeneral medical settingQualitative interviewsInterview input from clinical leaders and managersTo understand how the clinical leadership perceives the inpatient service provided for people with morbid obesity, to improve the service465(2019)AustraliaTertiary care, specialistQuantitative case-control observational studyMedical recordsTo develop a model based on the existing medical records to enable predictions on the non-completion of a specialist clinical MDT obesity management program for patients with severe obesity566(2021)CanadaPrimary care, specialistConvergent mixed-method randomized control trialPatient intake questionnaires and electronic medical recordsTo analyze the patterns of weight loss history and weight loss goals of patients enrolled in a publicly funded specialist obesity clinic through referrals667(2022)CanadaPrimary care, specialistQuantitative retrospective chart reviewPatient intake questionnaires and electronic medical recordsTo explore how weight loss is achieved in patients at a publicly funded, evidence-based clinical obesity management program. the impact of weight-loss history (frequency and amount), the age of overweight onset769(2023)New ZealandPrimary careQualitative interviewsInterview input from general practitionersTo identify the factors that inhibit the delivery of clinical obesity services for the local community868(2022)New ZealandPrimary careQualitative interviewsInterview input from participantsTo identify the factors that inhibit effective weight management of people with obesity who have joined the local general clinical practice970(2017)UKPrimary care, specialistQuantitative observational cross-sectional studyElectronic medical recordsTo examine how the patient characteristics and the clinical practitioner’s referring practice affect the attendance and completion of a specialist clinical obesity service1071(2018)UKSecondary care, specialistMixed-method design (quantitative retrospective pre-post study, survey, interview)Electronic medical records, participant survey (general public, clinical practitioners, and service delivery team), interview input from service teamsTo conduct an evaluation on the process and outcomes of specialist weight management service completion rates; weight loss at 12 weeks; follow-up weight loss and maintenance1172(2023)UKPrimary care, specialistQualitative interviewsResidents who are eligible for a tier-2 weight management serviceTo examine influencers on the signing-up decisions of residents who fulfil the eligibility criteria of a tier-2 weight management service when receiving a referral opportunity1273(2023)USPrimary careQuantitative observational cohort studyElectronic medical records of clinic-, provider-, and patient-level data (participants were adults with a BMI >25 kg/m2seen in family medicine clinics)To assess the impact of a novel program that promotes the prioritization of obesity treatment in primary care on the actual provision of weight-prioritized clinic visits1374(2022)USPrimary careQuantitative surveyPrimary care providersTo evaluate the amount of weight management services provided and factors on the service provision1475(2020)USPrimary careQuantitative retrospective cohort studyElectronic medical recordsTo examine the diagnosis rate of obesity, use of pharmacologic and surgical therapies, and weight change of the population of the study (all patients aged ≥18 years who were seen in a primary care clinic within a specific health system)1576(2019)USGeneral medical settingQuantitative cross-sectional data2011 to 2012 National Health and Nutrition Examination Survey (NHANES) data on patients with overweight or obesityTo explore the proportion of people who reported seeking clinical obesity services when being advised to do so.1677(2020)USGeneral medical settingQuantitative cross-sectional data2011–2018 NHANES data on respondents who were adults with overweight/obesity and had seen an HCP in the previous 12 monthsTo examine the association of patient characteristics and their receipt pattern of HCP counselling and or acting on the lifestyle behavioral advice for weight management.1778(2023)USPrimary careQuantitative cohort study2013–2019 Centers for Medicare and Medicaid Services Provider Utilization and Payment DataTo analyze the service provision pattern of Intensive Behavior Therapy (IBT) among PCPs for Medicare and Medicaid beneficiaries1879(2017)USGeneral medical settingQuantitative cross-sectional analysisElectronic medical recordsTo analyze the prevalence of obesity and its comorbidities among patients in a large health system based on real-world data, and to assess the proportion of patients who received a formal diagnosis of obesity and their characteristics1980(2017)USPrimary careQualitative combined studies (literature review and expert interviews)Literature and input from PCPs, physical assistants, nurse practitioners, and patient advocatesTo study the delivery of clinical obesity service for patients and the challenges of primary care providers2081(2017)USGeneral medical settingQuantitative cross-sectional surveySurvey data from the US HPs including dieticians, nurses, mental HPs, exercise professionals and pharmacistsTo explore the perceived challenges and ways out in the delivery of clinical obesity service, and possible factors2182(2023)USPrimary careMixed-method (quantitative survey and qualitative interviews)Primary care providers (PCPs)To identify the provision pattern of clinical obesity services by the PCPs and the barriers that inhibit the service delivery\n\nCharacteristics of the Included Studies\n\nWith careful consideration of the study perspectives, aims, and major findings of the included studies, we first identified the following themes that emerge: service context, supporting resources, service delivery, service utilization, and service outcomes. The theme of “service delivery” refers to studies collecting data and viewpoints from healthcare providers and administration on delivering services to patients. The theme of “service utilization” specifies studies collecting data and viewpoints from patients or potential targets of relevant services on the initiation, and utilization of relevant services. The theme of “service outcomes” implies those studies reporting or analyzing the outcomes (eg, weight change, other health benefits obtained) as the main findings.\n\n“Service context” covers studies examining the context for service delivery and utilization, which may include social awareness and culture, organizational culture, etc. “Supporting resources” refers to diverse resources needed to facilitate the delivery or utilization of services. These themes will constitute the subsystems of the causal loop diagram to be established. Their internal relations, as depicted inFigure 2, will direct the construction of CLDs from a bundle of variables. Service utilization and delivery are in reciprocal influences. Both are affected by the service context and supporting resources. Service outcomes are the results of the synergic effect of the other themes, and, in turn, will impact service utilization and delivery.Figure 2Interactions between main themes surrounding the delivery and utilization of clinical obesity services identified from the included studies.\n\nInteractions between main themes surrounding the delivery and utilization of clinical obesity services identified from the included studies.\n\nTable 2demonstrates the variables we identified under each theme from the 21 studies. We standardized the tagging of the variables for easy reference and convenience in the follow-up diagramming. In total, we identified two variables regarding service context, 13 variables regarding service delivery, 11 variables about service utilization, six variables about supporting resources, and two variables about service outcomes.Table 2Themes and Variables Included in the CLDNo.Ref.Service Context(number of Variables: 2)Service Delivery(Number of Variables: 13)Service Utilization(Number of Variables: 11)Supporting Resources(Number of Variables: 6)Service Outcomes(Number of Variables: 2)162(2019)Perceptions of obesityService capacity planningImplementation of clinical practice guidelinesBuilt-in workflow and proceduresEffective communication on obesityObesity-specific training and education263(2021)Perceptions of obesityClear care pathwayMDTObesity-specific training and educationEconomic resourcesProfessional workforceAvailability of obesity-friendly physical infrastructures and equipment364(2020)Perceptions of obesityService capacity planningIndividualized careObesity-specific training and educationAvailability of obesity-friendly physical infrastructure and equipment465(2019)Completion of programSeverity of complications566(2021)Initiation of obesity-prioritized servicePatient current BMISuccessful weight loss history weight loss goals667(2022)Successful weight loss historyWeight loss achieved769(2023)Sociocultural normsFeasibility of effective intervention optionsEconomic resources868(2022)Sociocultural normsFeasibility of effective intervention optionsInitiation of weight management serviceSocio-economic status970(2017)Obesity-specific training and educationPatient Current BMIAttendance and completion of weight loss service1071(2018)Clear care pathways and flexible self-referral optionsStandardized collection, documentation and utilization of obesity-relevant dataConvenient localityObesity-specific training and educationEffective communication on obesityAttendance and completion of weight loss servicePromotion of relevant servicesSupport from wider health and social care professionalsWeight loss achievedFollow-up weight loss and maintenance1172(2023)Perceptions of obesityInitiation of obesity servicePsychological readinessOut-of-pocket paymentTime for attending the servicePromotion of relevant servicesHealth insurance coverage1273(2023)Standardized collection, documentation and utilization of obesity-relevant EHR dataObesity-specific training and educationBuilt-in workflow and proceduresCommunication on obesityInitiation of obesity-prioritized serviceWeight loss achieved1374(2022)Built-in workflow and proceduresCommunication on obesityInitiation of obesity-prioritized service1475(2020)Formal diagnosis and assessment of obesityFeasibility of effective treatment optionsIndividualized care planStandardized collection, documentation and utilization of obesity-relevant EHR dataObesity-specific training and educationBuilt-in workflow and proceduresHealth insurance coverageWeight loss achieved1576(2019)Initiation of weight loss serviceOut-of-pocket paymentFrequent healthcare utilization1677(2020)Initiation of obesity serviceActions on recommendations from HCPsSeverity of obesity1778(2023)Uptake of obesity serviceTime for attending a serviceOut-of-pocket payment1879(2017)Formal diagnosis of obesityStandardized collection, documentation and utilization of obesity-relevant EHR dataCommunication on obesity1980(2017)Built-in workflow and proceduresMDT2081(2017)Health insurance coverageWeight loss achieved2182(2023)Formal diagnosis of obesityBuilt-in workflow and proceduresCommunication on obesityAvailability of effective treatment optionsOut-of-pocket paymentAbbreviation: MDT, multi-disciplinary team; HER, electronic health records; HCP, healthcare providers.\n\nThemes and Variables Included in the CLD\n\nPerceptions of obesity\n\nService capacity planning\n\nImplementation of clinical practice guidelines\n\nBuilt-in workflow and procedures\n\nEffective communication on obesity\n\nObesity-specific training and education\n\nPerceptions of obesity\n\nClear care pathway\n\nMDT\n\nObesity-specific training and education\n\nEconomic resources\n\nProfessional workforce\n\nAvailability of obesity-friendly physical infrastructures and equipment\n\nPerceptions of obesity\n\nService capacity planning\n\nIndividualized care\n\nObesity-specific training and education\n\nAvailability of obesity-friendly physical infrastructure and equipment\n\nCompletion of program\n\nSeverity of complications\n\nInitiation of obesity-prioritized service\n\nPatient current BMI\n\nSuccessful weight loss history weight loss goals\n\nSuccessful weight loss history\n\nWeight loss achieved\n\nSociocultural norms\n\nFeasibility of effective intervention options\n\nEconomic resources\n\nSociocultural norms\n\nFeasibility of effective intervention options\n\nInitiation of weight management service\n\nSocio-economic status\n\nObesity-specific training and education\n\nPatient Current BMI\n\nAttendance and completion of weight loss service\n\nClear care pathways and flexible self-referral options\n\nStandardized collection, documentation and utilization of obesity-relevant data\n\nConvenient locality\n\nObesity-specific training and education\n\nEffective communication on obesity\n\nAttendance and completion of weight loss service\n\nPromotion of relevant services\n\nSupport from wider health and social care professionals\n\nWeight loss achieved\n\nFollow-up weight loss and maintenance\n\nPerceptions of obesity\n\nInitiation of obesity service\n\nPsychological readiness\n\nOut-of-pocket payment\n\nTime for attending the service\n\nPromotion of relevant services\n\nHealth insurance coverage\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nObesity-specific training and education\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nInitiation of obesity-prioritized service\n\nWeight loss achieved\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nInitiation of obesity-prioritized service\n\nFormal diagnosis and assessment of obesity\n\nFeasibility of effective treatment options\n\nIndividualized care plan\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nObesity-specific training and education\n\nBuilt-in workflow and procedures\n\nHealth insurance coverage\n\nWeight loss achieved\n\nInitiation of weight loss service\n\nOut-of-pocket payment\n\nFrequent healthcare utilization\n\nInitiation of obesity service\n\nActions on recommendations from HCPs\n\nSeverity of obesity\n\nUptake of obesity service\n\nTime for attending a service\n\nOut-of-pocket payment\n\nFormal diagnosis of obesity\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nCommunication on obesity\n\nBuilt-in workflow and procedures\n\nMDT\n\nHealth insurance coverage\n\nWeight loss achieved\n\nFormal diagnosis of obesity\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nAvailability of effective treatment options\n\nOut-of-pocket payment\n\nAbbreviation: MDT, multi-disciplinary team; HER, electronic health records; HCP, healthcare providers.\n\nThe causal linkages between the variables included were established through an iterative process by referring to the relevant findings from the included studies. The final product was thoroughly discussed to reach a consensus on the included variables and causal links to be included among the research team. The finalized causal loop diagram encompasses 19 variables and 38 causal arrows between these variables, as displayed inFigure 3. Of these variables, 13 are interconnected with many other variables in many loops.Figure 3Causal Loop Diagram on the delivery and utilization of clinical obesity service.\n\nCausal Loop Diagram on the delivery and utilization of clinical obesity service.\n\nThe following provides a detailed account of the loops that emerged as potential intervention points for the improvement of service utilization and delivery of clinical obesity services,\n\nLoops R1 & R2: The reinforcing loop R1 demonstrates that patients’ previous perceptions and awareness of obesity as a disease affect the current severity of obesity and related complications. The enhancement of their perceptions would help to improve their obesity-related condition and understanding of the necessity of weight reduction. Thus, it would prompt these patients to join in an obesity-prioritized service, if they have been suffering from severe obesity and related complications due to their prior low perceptions of obesity as a disease and its health consequences.66,70,72,73,76Certain weight reduction and health improvement may be observed once they take proactive actions on HCPs’ recommendations after attending and completing obesity-prioritized services. A successful weight loss experience could then reinforce their understanding of the importance of proper recognition of obesity and the necessity of seeking professional help from clinical services. The Loop R2, sharing similar path with Loop R1, indicates that the promotional activities/campaigns on obesity as a disease and relevant clinical services could drive virtuous loop of improved perceptions and awareness of obesity as a disease in the Loop R1.71\n\nLoop R3: The Loop R3 shows that the active promotion of obesity-related knowledge can also lead to the improved recognition of the disease of healthcare providers, hence positively influence their prioritization of obesity in clinical service capacity planning.62–64Once such a plan is in place, there would be an endogenous demand to improve the professional knowledge and clinical practice skills in managing obesity through strengthening the training and education concerning this specific disease. With elevated professionalism, HCPs involved in an MDT care team will be more likely to play their parts in delivering the clinical obesity services, which includes tailor-making care plans with necessary treatment options for different patients. Consequently, an appropriate individualized treatment strategy is the key step in helping patients to achieve desirable weight loss outcomes and other health benefits.67,71,73,75,81Successful cases of clinical obesity management would help to build the real-world evidence base for promoting obesity and relevant services, resulting in a reinforcing loop.\n\nLoop R4: Healthcare providers involved in clinical obesity services need obesity-specific training and continual education opportunities to equip them with up-to-date evidence-based knowledge and clinical practices regarding obesity management.62–64,70,71,73,75In this way, HCPs will be more likely to recognize obesity as a disease with medical necessity, hence encouraging them to make more efforts in the health promotion of obesity and relevant services. With elevated public awareness of obesity as a disease, an increase in the demand for clinical obesity services may be observed subsequently. The administrations of clinical institutions will be more likely to be incentivized to plan capacity for obesity-prioritized services and consider mandating relevant services in the workflow. In turn, these service provision requirements may create larger needs for obesity-specific training and continual education opportunities for HCPs.\n\nLoop R5: The prioritization of obesity in the existing workflow and medical procedures will enable HCPs to have time and mandate to have obesity-relevant communications with patients concerned in a more proactively way.62,64,73–75,80,82Such communications will influence patients’ awareness and willingness to take an obesity-prioritized assessment and treatment.62,79,82Actions of patients are vital to the health outcomes they could achieve from clinical obesity services. As obesity is a relapsing chronic disease requiring long-term management, positive weight loss experiences may further raise their awareness towards the disease. Consecutively, the increased perceptions of the disease would generate more demands for clinical obesity services from patients, bringing about a reinforcing loop of increased supply.\n\nLoop R6: The standardized and high-quality obesity-relevant EHR data can help to generate comprehensive evidence for HCPs to make a diagnosis of obesity for patients evidence.71,73,75,79In this way, the relevant clinical practice guidelines to deliver services to the patients. In turn, high-quality obesity-relevant data would be collected and documented by following the guidelines closely.\n\nLoop R7: The involvement of an MDT plays a pivotal role in implementing obesity-related clinical practice guidelines.63,80With good knowledge of the guidelines, the healthcare delivery team would be able to collect and document standardized quality obesity-relevant data to inform the formal diagnosis, and follow-up individualized care plan making. Such endeavors may directly influence the weight loss outcomes of patients attending the service. In turn, health benefits that patients achieve from such a service may impact their perceptions of obesity and relevant services. On the other hand, this would then link back to the Loop R1 to influence the improvement in service delivery alongside the enhanced perceptions of obesity of HCPs.\n\nIn addition to these variables forming various loops, adequate financing and funding support is inevitably a key player in delivering clinical obesity services by supporting the service promotion and establishment of MDTs, and ensuring accessibility of necessary and effective treatment strategies for patients with obesity.68,69,72,75,81"
    },
    {
      "heading": "General Characteristics of the Included Studies",
      "text": "The data identification and selection process are displayed inFigure 1. There were 6710 articles identified through our initial search from databases. In parallel, we conducted a step of hand search of the key references in our preliminary research, which generated 209 articles on relevant topics. After de-duplicating 63 items, we screened the remaining 6856 studies by their titles and abstracts. We then examined the 219 eligible full-text articles for final inclusion. By assessing the relevance and quality of the evidence, we identified 21 studies for the follow-up review procedure.Figure 1Flow diagram of study selection.\n\nFlow diagram of study selection.\n\nTable 1contains the basic characteristics of the included studies. They were performed in five countries: Australia,62–65Canada,66,67New Zealand,68,69the UK,70–72and the US.73–82The settings of the clinical obesity services examined in these studies were diverse. Thirteen studies were in the primary care setting,62,66–70,72–75,78,80,82three studies were in a secondary/tertiary care setting (3,5,11), and the rest were in a general medical setting.64,76,77,79,81The research designs include three major categories: qualitative approach,62–64,68,69,72,80quantitative approach,65–67,70,73–79,81and mixed-methods approach.71,82Among the seven qualitative studies, interviews were the primary channel to collect primary data from different groups of stakeholders, eg, healthcare providers, clinical administrations, service teams, patients, and the public. The data from the 12 quantitative studies were mainly obtained from electronic medical records and surveys.Table 1Characteristics of the Included StudiesNoRef.CountrySettingStudy DesignData InvestigatedPrimary Research Questions162(2019)AustraliaPrimary careQualitative interviewsInterview input from clinical practitionersTo investigate the factors that impact the clinical practitioners’ execution of a clinical practice guideline for the management of obesity and overweight in Australia263(2021)AustraliaTertiary careQualitative interviewsInterview input from clinical leaders and managers working in services that care for patients with obesityTo understand how the clinical leadership perceives the inpatient service provided for people with morbid obesity364(2020)AustraliaGeneral medical settingQualitative interviewsInterview input from clinical leaders and managersTo understand how the clinical leadership perceives the inpatient service provided for people with morbid obesity, to improve the service465(2019)AustraliaTertiary care, specialistQuantitative case-control observational studyMedical recordsTo develop a model based on the existing medical records to enable predictions on the non-completion of a specialist clinical MDT obesity management program for patients with severe obesity566(2021)CanadaPrimary care, specialistConvergent mixed-method randomized control trialPatient intake questionnaires and electronic medical recordsTo analyze the patterns of weight loss history and weight loss goals of patients enrolled in a publicly funded specialist obesity clinic through referrals667(2022)CanadaPrimary care, specialistQuantitative retrospective chart reviewPatient intake questionnaires and electronic medical recordsTo explore how weight loss is achieved in patients at a publicly funded, evidence-based clinical obesity management program. the impact of weight-loss history (frequency and amount), the age of overweight onset769(2023)New ZealandPrimary careQualitative interviewsInterview input from general practitionersTo identify the factors that inhibit the delivery of clinical obesity services for the local community868(2022)New ZealandPrimary careQualitative interviewsInterview input from participantsTo identify the factors that inhibit effective weight management of people with obesity who have joined the local general clinical practice970(2017)UKPrimary care, specialistQuantitative observational cross-sectional studyElectronic medical recordsTo examine how the patient characteristics and the clinical practitioner’s referring practice affect the attendance and completion of a specialist clinical obesity service1071(2018)UKSecondary care, specialistMixed-method design (quantitative retrospective pre-post study, survey, interview)Electronic medical records, participant survey (general public, clinical practitioners, and service delivery team), interview input from service teamsTo conduct an evaluation on the process and outcomes of specialist weight management service completion rates; weight loss at 12 weeks; follow-up weight loss and maintenance1172(2023)UKPrimary care, specialistQualitative interviewsResidents who are eligible for a tier-2 weight management serviceTo examine influencers on the signing-up decisions of residents who fulfil the eligibility criteria of a tier-2 weight management service when receiving a referral opportunity1273(2023)USPrimary careQuantitative observational cohort studyElectronic medical records of clinic-, provider-, and patient-level data (participants were adults with a BMI >25 kg/m2seen in family medicine clinics)To assess the impact of a novel program that promotes the prioritization of obesity treatment in primary care on the actual provision of weight-prioritized clinic visits1374(2022)USPrimary careQuantitative surveyPrimary care providersTo evaluate the amount of weight management services provided and factors on the service provision1475(2020)USPrimary careQuantitative retrospective cohort studyElectronic medical recordsTo examine the diagnosis rate of obesity, use of pharmacologic and surgical therapies, and weight change of the population of the study (all patients aged ≥18 years who were seen in a primary care clinic within a specific health system)1576(2019)USGeneral medical settingQuantitative cross-sectional data2011 to 2012 National Health and Nutrition Examination Survey (NHANES) data on patients with overweight or obesityTo explore the proportion of people who reported seeking clinical obesity services when being advised to do so.1677(2020)USGeneral medical settingQuantitative cross-sectional data2011–2018 NHANES data on respondents who were adults with overweight/obesity and had seen an HCP in the previous 12 monthsTo examine the association of patient characteristics and their receipt pattern of HCP counselling and or acting on the lifestyle behavioral advice for weight management.1778(2023)USPrimary careQuantitative cohort study2013–2019 Centers for Medicare and Medicaid Services Provider Utilization and Payment DataTo analyze the service provision pattern of Intensive Behavior Therapy (IBT) among PCPs for Medicare and Medicaid beneficiaries1879(2017)USGeneral medical settingQuantitative cross-sectional analysisElectronic medical recordsTo analyze the prevalence of obesity and its comorbidities among patients in a large health system based on real-world data, and to assess the proportion of patients who received a formal diagnosis of obesity and their characteristics1980(2017)USPrimary careQualitative combined studies (literature review and expert interviews)Literature and input from PCPs, physical assistants, nurse practitioners, and patient advocatesTo study the delivery of clinical obesity service for patients and the challenges of primary care providers2081(2017)USGeneral medical settingQuantitative cross-sectional surveySurvey data from the US HPs including dieticians, nurses, mental HPs, exercise professionals and pharmacistsTo explore the perceived challenges and ways out in the delivery of clinical obesity service, and possible factors2182(2023)USPrimary careMixed-method (quantitative survey and qualitative interviews)Primary care providers (PCPs)To identify the provision pattern of clinical obesity services by the PCPs and the barriers that inhibit the service delivery\n\nCharacteristics of the Included Studies"
    },
    {
      "heading": "Themes and Variables of the Delivery and Utilization of Clinical Obesity Service",
      "text": "With careful consideration of the study perspectives, aims, and major findings of the included studies, we first identified the following themes that emerge: service context, supporting resources, service delivery, service utilization, and service outcomes. The theme of “service delivery” refers to studies collecting data and viewpoints from healthcare providers and administration on delivering services to patients. The theme of “service utilization” specifies studies collecting data and viewpoints from patients or potential targets of relevant services on the initiation, and utilization of relevant services. The theme of “service outcomes” implies those studies reporting or analyzing the outcomes (eg, weight change, other health benefits obtained) as the main findings.\n\n“Service context” covers studies examining the context for service delivery and utilization, which may include social awareness and culture, organizational culture, etc. “Supporting resources” refers to diverse resources needed to facilitate the delivery or utilization of services. These themes will constitute the subsystems of the causal loop diagram to be established. Their internal relations, as depicted inFigure 2, will direct the construction of CLDs from a bundle of variables. Service utilization and delivery are in reciprocal influences. Both are affected by the service context and supporting resources. Service outcomes are the results of the synergic effect of the other themes, and, in turn, will impact service utilization and delivery.Figure 2Interactions between main themes surrounding the delivery and utilization of clinical obesity services identified from the included studies.\n\nInteractions between main themes surrounding the delivery and utilization of clinical obesity services identified from the included studies.\n\nTable 2demonstrates the variables we identified under each theme from the 21 studies. We standardized the tagging of the variables for easy reference and convenience in the follow-up diagramming. In total, we identified two variables regarding service context, 13 variables regarding service delivery, 11 variables about service utilization, six variables about supporting resources, and two variables about service outcomes.Table 2Themes and Variables Included in the CLDNo.Ref.Service Context(number of Variables: 2)Service Delivery(Number of Variables: 13)Service Utilization(Number of Variables: 11)Supporting Resources(Number of Variables: 6)Service Outcomes(Number of Variables: 2)162(2019)Perceptions of obesityService capacity planningImplementation of clinical practice guidelinesBuilt-in workflow and proceduresEffective communication on obesityObesity-specific training and education263(2021)Perceptions of obesityClear care pathwayMDTObesity-specific training and educationEconomic resourcesProfessional workforceAvailability of obesity-friendly physical infrastructures and equipment364(2020)Perceptions of obesityService capacity planningIndividualized careObesity-specific training and educationAvailability of obesity-friendly physical infrastructure and equipment465(2019)Completion of programSeverity of complications566(2021)Initiation of obesity-prioritized servicePatient current BMISuccessful weight loss history weight loss goals667(2022)Successful weight loss historyWeight loss achieved769(2023)Sociocultural normsFeasibility of effective intervention optionsEconomic resources868(2022)Sociocultural normsFeasibility of effective intervention optionsInitiation of weight management serviceSocio-economic status970(2017)Obesity-specific training and educationPatient Current BMIAttendance and completion of weight loss service1071(2018)Clear care pathways and flexible self-referral optionsStandardized collection, documentation and utilization of obesity-relevant dataConvenient localityObesity-specific training and educationEffective communication on obesityAttendance and completion of weight loss servicePromotion of relevant servicesSupport from wider health and social care professionalsWeight loss achievedFollow-up weight loss and maintenance1172(2023)Perceptions of obesityInitiation of obesity servicePsychological readinessOut-of-pocket paymentTime for attending the servicePromotion of relevant servicesHealth insurance coverage1273(2023)Standardized collection, documentation and utilization of obesity-relevant EHR dataObesity-specific training and educationBuilt-in workflow and proceduresCommunication on obesityInitiation of obesity-prioritized serviceWeight loss achieved1374(2022)Built-in workflow and proceduresCommunication on obesityInitiation of obesity-prioritized service1475(2020)Formal diagnosis and assessment of obesityFeasibility of effective treatment optionsIndividualized care planStandardized collection, documentation and utilization of obesity-relevant EHR dataObesity-specific training and educationBuilt-in workflow and proceduresHealth insurance coverageWeight loss achieved1576(2019)Initiation of weight loss serviceOut-of-pocket paymentFrequent healthcare utilization1677(2020)Initiation of obesity serviceActions on recommendations from HCPsSeverity of obesity1778(2023)Uptake of obesity serviceTime for attending a serviceOut-of-pocket payment1879(2017)Formal diagnosis of obesityStandardized collection, documentation and utilization of obesity-relevant EHR dataCommunication on obesity1980(2017)Built-in workflow and proceduresMDT2081(2017)Health insurance coverageWeight loss achieved2182(2023)Formal diagnosis of obesityBuilt-in workflow and proceduresCommunication on obesityAvailability of effective treatment optionsOut-of-pocket paymentAbbreviation: MDT, multi-disciplinary team; HER, electronic health records; HCP, healthcare providers.\n\nThemes and Variables Included in the CLD\n\nPerceptions of obesity\n\nService capacity planning\n\nImplementation of clinical practice guidelines\n\nBuilt-in workflow and procedures\n\nEffective communication on obesity\n\nObesity-specific training and education\n\nPerceptions of obesity\n\nClear care pathway\n\nMDT\n\nObesity-specific training and education\n\nEconomic resources\n\nProfessional workforce\n\nAvailability of obesity-friendly physical infrastructures and equipment\n\nPerceptions of obesity\n\nService capacity planning\n\nIndividualized care\n\nObesity-specific training and education\n\nAvailability of obesity-friendly physical infrastructure and equipment\n\nCompletion of program\n\nSeverity of complications\n\nInitiation of obesity-prioritized service\n\nPatient current BMI\n\nSuccessful weight loss history weight loss goals\n\nSuccessful weight loss history\n\nWeight loss achieved\n\nSociocultural norms\n\nFeasibility of effective intervention options\n\nEconomic resources\n\nSociocultural norms\n\nFeasibility of effective intervention options\n\nInitiation of weight management service\n\nSocio-economic status\n\nObesity-specific training and education\n\nPatient Current BMI\n\nAttendance and completion of weight loss service\n\nClear care pathways and flexible self-referral options\n\nStandardized collection, documentation and utilization of obesity-relevant data\n\nConvenient locality\n\nObesity-specific training and education\n\nEffective communication on obesity\n\nAttendance and completion of weight loss service\n\nPromotion of relevant services\n\nSupport from wider health and social care professionals\n\nWeight loss achieved\n\nFollow-up weight loss and maintenance\n\nPerceptions of obesity\n\nInitiation of obesity service\n\nPsychological readiness\n\nOut-of-pocket payment\n\nTime for attending the service\n\nPromotion of relevant services\n\nHealth insurance coverage\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nObesity-specific training and education\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nInitiation of obesity-prioritized service\n\nWeight loss achieved\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nInitiation of obesity-prioritized service\n\nFormal diagnosis and assessment of obesity\n\nFeasibility of effective treatment options\n\nIndividualized care plan\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nObesity-specific training and education\n\nBuilt-in workflow and procedures\n\nHealth insurance coverage\n\nWeight loss achieved\n\nInitiation of weight loss service\n\nOut-of-pocket payment\n\nFrequent healthcare utilization\n\nInitiation of obesity service\n\nActions on recommendations from HCPs\n\nSeverity of obesity\n\nUptake of obesity service\n\nTime for attending a service\n\nOut-of-pocket payment\n\nFormal diagnosis of obesity\n\nStandardized collection, documentation and utilization of obesity-relevant EHR data\n\nCommunication on obesity\n\nBuilt-in workflow and procedures\n\nMDT\n\nHealth insurance coverage\n\nWeight loss achieved\n\nFormal diagnosis of obesity\n\nBuilt-in workflow and procedures\n\nCommunication on obesity\n\nAvailability of effective treatment options\n\nOut-of-pocket payment\n\nAbbreviation: MDT, multi-disciplinary team; HER, electronic health records; HCP, healthcare providers."
    },
    {
      "heading": "Causal Loop Diagramming",
      "text": "The causal linkages between the variables included were established through an iterative process by referring to the relevant findings from the included studies. The final product was thoroughly discussed to reach a consensus on the included variables and causal links to be included among the research team. The finalized causal loop diagram encompasses 19 variables and 38 causal arrows between these variables, as displayed inFigure 3. Of these variables, 13 are interconnected with many other variables in many loops.Figure 3Causal Loop Diagram on the delivery and utilization of clinical obesity service.\n\nCausal Loop Diagram on the delivery and utilization of clinical obesity service.\n\nThe following provides a detailed account of the loops that emerged as potential intervention points for the improvement of service utilization and delivery of clinical obesity services,\n\nLoops R1 & R2: The reinforcing loop R1 demonstrates that patients’ previous perceptions and awareness of obesity as a disease affect the current severity of obesity and related complications. The enhancement of their perceptions would help to improve their obesity-related condition and understanding of the necessity of weight reduction. Thus, it would prompt these patients to join in an obesity-prioritized service, if they have been suffering from severe obesity and related complications due to their prior low perceptions of obesity as a disease and its health consequences.66,70,72,73,76Certain weight reduction and health improvement may be observed once they take proactive actions on HCPs’ recommendations after attending and completing obesity-prioritized services. A successful weight loss experience could then reinforce their understanding of the importance of proper recognition of obesity and the necessity of seeking professional help from clinical services. The Loop R2, sharing similar path with Loop R1, indicates that the promotional activities/campaigns on obesity as a disease and relevant clinical services could drive virtuous loop of improved perceptions and awareness of obesity as a disease in the Loop R1.71\n\nLoop R3: The Loop R3 shows that the active promotion of obesity-related knowledge can also lead to the improved recognition of the disease of healthcare providers, hence positively influence their prioritization of obesity in clinical service capacity planning.62–64Once such a plan is in place, there would be an endogenous demand to improve the professional knowledge and clinical practice skills in managing obesity through strengthening the training and education concerning this specific disease. With elevated professionalism, HCPs involved in an MDT care team will be more likely to play their parts in delivering the clinical obesity services, which includes tailor-making care plans with necessary treatment options for different patients. Consequently, an appropriate individualized treatment strategy is the key step in helping patients to achieve desirable weight loss outcomes and other health benefits.67,71,73,75,81Successful cases of clinical obesity management would help to build the real-world evidence base for promoting obesity and relevant services, resulting in a reinforcing loop.\n\nLoop R4: Healthcare providers involved in clinical obesity services need obesity-specific training and continual education opportunities to equip them with up-to-date evidence-based knowledge and clinical practices regarding obesity management.62–64,70,71,73,75In this way, HCPs will be more likely to recognize obesity as a disease with medical necessity, hence encouraging them to make more efforts in the health promotion of obesity and relevant services. With elevated public awareness of obesity as a disease, an increase in the demand for clinical obesity services may be observed subsequently. The administrations of clinical institutions will be more likely to be incentivized to plan capacity for obesity-prioritized services and consider mandating relevant services in the workflow. In turn, these service provision requirements may create larger needs for obesity-specific training and continual education opportunities for HCPs.\n\nLoop R5: The prioritization of obesity in the existing workflow and medical procedures will enable HCPs to have time and mandate to have obesity-relevant communications with patients concerned in a more proactively way.62,64,73–75,80,82Such communications will influence patients’ awareness and willingness to take an obesity-prioritized assessment and treatment.62,79,82Actions of patients are vital to the health outcomes they could achieve from clinical obesity services. As obesity is a relapsing chronic disease requiring long-term management, positive weight loss experiences may further raise their awareness towards the disease. Consecutively, the increased perceptions of the disease would generate more demands for clinical obesity services from patients, bringing about a reinforcing loop of increased supply.\n\nLoop R6: The standardized and high-quality obesity-relevant EHR data can help to generate comprehensive evidence for HCPs to make a diagnosis of obesity for patients evidence.71,73,75,79In this way, the relevant clinical practice guidelines to deliver services to the patients. In turn, high-quality obesity-relevant data would be collected and documented by following the guidelines closely.\n\nLoop R7: The involvement of an MDT plays a pivotal role in implementing obesity-related clinical practice guidelines.63,80With good knowledge of the guidelines, the healthcare delivery team would be able to collect and document standardized quality obesity-relevant data to inform the formal diagnosis, and follow-up individualized care plan making. Such endeavors may directly influence the weight loss outcomes of patients attending the service. In turn, health benefits that patients achieve from such a service may impact their perceptions of obesity and relevant services. On the other hand, this would then link back to the Loop R1 to influence the improvement in service delivery alongside the enhanced perceptions of obesity of HCPs.\n\nIn addition to these variables forming various loops, adequate financing and funding support is inevitably a key player in delivering clinical obesity services by supporting the service promotion and establishment of MDTs, and ensuring accessibility of necessary and effective treatment strategies for patients with obesity.68,69,72,75,81"
    },
    {
      "heading": "Discussions",
      "text": "The current research is aimed at constructing an analytical overview of the key variables and drivers influencing the delivery and utilization of clinical obesity services for adult patients with obesity by synthesizing original studies pertinent to this topic through the lens of system dynamics. The CLD was created based on the scoping review of the literature. It not only demonstrates the multitude of variables surrounding the implementation of a clinical obesity service but also provides insights into the possible complex interrelationships among them. This system dynamics approach has been utilized in investigating different determinants of obesity occurrence and prevalence, and the development and evaluation of various interventions. However, to our knowledge, our study is the first to use CLD to study the implementation issue about clinical services for adult patients with obesity.\n\nAnother value of this research is that the feedback loops in the resultant diagram reveal areas with great potentials for bringing systematic changes to improve the delivery of clinical services for the adult population with obesity. The diagram suggests that promoting the perception of obesity as a disease and the recognition of its medical needs among the public and healthcare professionals could bring leverage effects to the delivery and utilization of clinical obesity services. Also, as the pathophysiology research of obesity achieved great advancement only in recent years, it is necessary to equip healthcare providers and other support staff with updated evidence-based knowledge and practices about obesity through formal education and continuing training opportunities. Another possible leverage point is to build obesity-relevant or specific procedures into the clinical protocols to conduct necessary conversations, assessments and diagnoses of obesity. The effective implementation of such protocols will be facilitated by high-quality obesity relevant electronic health records collected and documented with a reasonable degree of standardization. Moreover, an integrated multidisciplinary team service is the crux of managing such a complex disease. These potential intervention points on resource mobilization and service innovation, together with the key components of clinical obesity services identified in our previous study, could provide guidance on the development, implementation, and optimization of clinical care for adult obesity in health systems.83\n\nThere are several limitations of this study worth noting. Firstly, the final CLD drawn out here is a preliminary CLD purely based on the published articles with a defined study focus. Presumably, this literature-based source of information may restrict our conceptualization of the core research question to capture all the underlying dynamics. Further direct dialogues with stakeholders are much in need of first-hand information to validate and refine the current CLD, and for strengthening our understanding of the development and optimization of clinical obesity services. Secondly, the healthcare settings of the clinical obesity services reported in the included studies are highly heterogeneous, ranging from community to tertiary care. And all of them are from the health systems in developed countries. This complicated mix of contextual factors may compound the generalizability of our findings. Further refined criteria of care levels for inclusion may improve the findings to be more targeted. This approach would only be viable if there are adequate original studies investigating factors influencing the implementation of clinical obesity services in similar settings."
    },
    {
      "heading": "Conclusions",
      "text": "This research probed into variables in and factors impacting the delivery and utilization of clinical services for adult patients with obesity from a scoping review of the literature with the aid of a qualitative system dynamics modelling approach. The resultant CLD contains 19 variables in five themes and 38 causal links between them. By analyzing the dynamics of the clinical obesity services revealed in this CLD, we identified possible activation points to improve and optimize the utilization and delivery, including enhancement of awareness and perceptions of obesity as a disease of both the public and healthcare providers, active promotion of obesity as a disease and relevant clinical services, strengthening of obesity-specific training and education, prioritization of clinical obesity services in the current clinical procedures, improvement of the EHR data system to support the assessment, diagnosis, treatment and long-term management of obesity, involvement of a qualified MDT, and so forth. It is vital for future studies to solicit more first-hand information from stakeholders with considerations of broader contextual varieties to generate further evidence base for these observations. Where possible, experimental or quantitative modelling research could be conducted to evaluate or predict the impact of potential leverage points on the systematic enhancement of clinical obesity services in various health systems."
    },
    {
      "heading": "Disclosure",
      "text": "The authors report no conflicts of interest in this work."
    }
  ],
  "authors": [
    "Xue Y",
    "Song M",
    "Yu H",
    "Chen X",
    "Ung COL",
    "Hu H.",
    "Yan Xue",
    "Menghuan Song",
    "Honho Yu",
    "Xianwen Chen",
    "Carolina Oi Lam Ung",
    "Hao Hu"
  ],
  "journal": "Diabetes, Metabolic Syndrome and Obesity",
  "doi": "10.2147/DMSO.S501149",
  "pmid": "40433462",
  "pmcid": "PMC12106910",
  "year": "2025"
}